* pdftotext
  


** man pdftotext

pdftotext [options] [PDF-file [text-file]]


Options

-f number
    Specifies the first page to convert.

-l number
    Specifies the last page to convert.

-layout
    Maintain (as best as possible) the original physical layout of the text. The default is to 'undo' physical layout (columns, hyphenation, etc.) and output the text in reading order.

-raw
    Keep the text in content stream order.  This is a hack which often "undoes" column formatting, etc.  Use of raw mode is no longer recommended.


** source block 05, blank template, session, raw, sh

| step | goal                     | target           |
|------+--------------------------+------------------|

#+NAME:
#+HEADERS: :session
#+HEADERS: :results raw
#+BEGIN_SRC sh


#+END_SRC

#+RESULTS:


** source block 07, long variable assignment

| step | goal                     | target           |
|------+--------------------------+------------------|

#+NAME:
#+HEADERS: :session
#+HEADERS: :results raw
#+BEGIN_SRC sh

test=$(printf 
'1'
2
3
)

# echo $test 

echo $test | sed -r 's/([0-9]) /\1 \n/g'

test1=$(echo $test | sed -r 's/([0-9]) /\1 \n/g')

echo 'test1 is' $test1

#+END_SRC

#+RESULTS:

test1 is
'1' 2 
3
test1 is '1' 2 3
1 
2 
3
test1 is 1 2 3
1 
2 
3
test1 is 1 2 3






** source block 15, define pdf file name #+NAME: the_pdf_name_block

| step | goal                     | target           |
|------+--------------------------+------------------|
|      | define the pdf file name | the_pdf_filename |
|      |                          |                  |
|      | print the file name      |                  |

#+NAME: the_pdf_name_block
#+HEADERS: :session
#+HEADERS: :results raw
#+BEGIN_SRC sh


the_pdf_filename="en_codedescribe.pdf"


# echo "\$the_pdf_filename is:" $the_pdf_filename

# echo "the_dir_under_home is" $the_dir_under_home

# echo "the_file_name is" $the_file_name

# echo "the_pdf_path is"  $the_pdf_path

# printf "The current directory, by default, through the command pwd, is: " ; pwd

#+END_SRC






** source block 17, extract raw text between page f, l through pdftotext

#+NAME: raw_output
#+HEADERS: :noweb yes
#+HEADERS: :results raw
#+HEADERS: :session
#+BEGIN_SRC sh
<<the_pdf_name_block>>

pdftotext -f 3 -l 4 -raw -nopgbrk $the_pdf_filename -
#+END_SRC


    

** source block 25, sed 

#+HEADERS: :noweb yes
#+HEADERS: :results raw
#+HEADERS: :session
#+BEGIN_SRC sh
 <<the_pdf_name_block>>

 raw_test=$(pdftotext -f 1 -l 2 -raw -nopgbrk $the_pdf_filename -)

 echo $raw_test

 echo $raw_test | sed -r 's/[.]{2,}/|/g' | sed -r 's/([0-9]+ )/\1\n/g'

#+END_SRC


** source block 30, 代碼說明 toc

#+HEADERS: :noweb yes
#+HEADERS: :results raw
#+HEADERS: :session
#+BEGIN_SRC sh
 <<the_pdf_name_block>>

 raw_test=$(pdftotext -f 1 -l 2 -raw -nopgbrk $the_pdf_filename -)

 echo $raw_test

 echo $raw_test | sed -r 's/[.]{2,}/|/g' | sed -r 's/([0-9]+ )/\1\n/g'

#+END_SRC


** source block 31, sed 評鑑等級

#+HEADERS: :noweb yes
#+HEADERS: :results raw
#+HEADERS: :session
#+BEGIN_SRC sh
 <<the_pdf_name_block>>

 raw_test=$(pdftotext -f 3 -l 4 -nopgbrk -raw $the_pdf_filename -)

#  pdftotext -f 3 -l 4 -nopgbrk -raw $the_pdf_filename -

#  pdftotext -f 3 -l 4 -nopgbrk -raw $the_pdf_filename - | sed -r 's/([^0-9]) ([^0-9])/\1\2/g'

#  echo $raw_test

# echo $raw_test | sed -r 's/[.]{2,}/|/g' | sed -r 's/([0-9]+ )/\1\n/g'

#  echo $raw_test | sed -r 's/([0-79][0-9] )/ \n\1\t/g' # | sed -r 's/([^0-9]) ([^0-9])/\1\2/' # |   awk '{print $1, $2, $3$4$5$6$7$8$9}'

#  echo $raw_test | sed -r 's/([0-79][0-9]) /\n\1, /g'
#  echo $raw_test | sed -r 's/([0-79][0-9]) /\n\1, /g' | sed -r 's/( 8[89] )/,\1/g'
   echo $raw_test | sed -r 's/([0-79][0-9]) /\n\1, /g' | sed -r 's/( 8[89] )/,\1/g' | sed -r 's/( 評鑑制度 )/,\1/g' 

# echo $raw_test | sed -r -e 's/( [0-4][0-9] )/ \n\1/g' -e 's/89/\n89/g'

#+END_SRC

#+RESULTS:
B-1 評鑑等級 

| 代碼 | 名稱                           | 備註                                                             |
|------+--------------------------------+------------------------------------------------------------------|
|   01 | 醫學中心                       | 89 年度起必為甲類教學醫院                                        |
|   02 | 準醫學中心                     | 89 年起醫院評鑑不再受理申請                                      |
|   03 | 區域醫院                       | 88 年度增加區域非教學醫院；89 年度可自由選擇為甲類/乙類教學 醫院 |
|   04 | 準區域醫院                     | 89 年起醫院評鑑不再受理申請                                      |
|   05 | 特殊功能教學醫院               | 89 年起醫院評鑑不再受理申請                                      |
|   06 | 地區教學醫院                   |                                                                  |
|   07 | 地區醫院                       |                                                                  |
|   08 | 精神專科教學醫院               |                                                                  |
|   09 | 精神專科醫院                   |                                                                  |
|   11 | 醫院評鑑優等                   |                                                                  |
|   12 | 醫院評鑑優等及教學合格         |                                                                  |
|   17 | 地區醫院(合格一年暫准合格)     | 89 年起醫院評鑑不再受理申請                                      |
|   19 | 精神專科醫院(合格一年暫准合格) | 89 年起醫院評鑑不再受理申請                                      |
|   21 | 西醫醫院(非評鑑、不合格)       |                                                                  |
|   22 | 中醫醫院(非評鑑、不合格)       |                                                                  |
|   31 | 新制醫院評鑑特優及甲類教學     | 評鑑制度 94.1 新增                                               |
|   32 | 新制醫院評鑑特優及乙類教學     | 評鑑制度 94.1 新增                                               |
|   33 | 新制醫院評鑑特優               | 評鑑制度 94.1 新增                                               |
|   34 | 新制醫院評鑑優等及甲類教學     | 評鑑制度 94.1 新增                                               |
|   35 | 新制醫院評鑑優等及乙類教學     | 評鑑制度 94.1 新增                                               |
|   36 | 新制醫院評鑑優等               | 評鑑制度 94.1 新增                                               |
|   37 | 新制醫院評鑑合格及甲類教學     | 評鑑制度 94.1 新增                                               |
|   38 | 新制醫院評鑑合格及乙類教學     | 評鑑制度 94.1 新增                                               |
|   39 | 新制醫院評鑑合格               | 評鑑制度 94.1 新增                                               |
|   40 | 新制精神科醫院評鑑優等及教學   | 評鑑制度 94.1 新增                                               |
|   41 | 新制精神科醫院評鑑優等         | 評鑑制度 94.1 新增                                               |
|   42 | 新制精神科醫院評鑑合格及教學   | 評鑑制度 94.1 新增                                               |
|   43 | 新制精神科醫院評鑑合格         | 評鑑制度 94.1 新增                                               |
|   98 | 特約藥局                       |                                                                  |
|   99 | 其它／基層診所                 |                                                                  |
|   XX | 不詳                           |                                                                  |


** source block 32, long variable assignment

#+NAME:
#+HEADERS: :session
#+HEADERS: :results raw
#+BEGIN_SRC sh

test32=$(echo "

 代碼 名稱 備註 
 01 醫學中心 89 年度起必為甲類教學醫院 
 02 準醫學中心 89 年起醫院評鑑不再受理申請 
 03 區域醫院 88 年度增加區域非教學醫院；89 年度可自由選擇為甲類/乙類教學 醫院 
 04 準區域醫院 89 年起醫院評鑑不再受理申請 
 05 特殊功能教學醫院 89 年起醫院評鑑不再受理申請 
 06 地區教學醫院 
 07 地區醫院 
 08 精神專科教學醫院 
 09 精神專科醫院 
 11 醫院評鑑優等 
 12 醫院評鑑優等及教學合 格 
 17 地區醫院(合格一年暫准合格) 89 年起醫院評鑑不再受理申請 
 19 精神專科醫院(合格一年暫准合格) 89 年起醫院評鑑不再受理申請 
 21 西醫醫院(非評鑑、不合格) 
 22 中醫醫院(非評鑑、不合格) 
 31 新制醫院評鑑特優及甲類教學 評鑑制度 94.1 新增 
 32 新制醫院評鑑特優及乙類教學 評鑑制度 94.1 新增 
 33 新制醫院評鑑特優 評鑑制度 94.1 新增 
 34 新制醫院評鑑優等及甲類教學 評鑑制度 94.1 新增 
 35 新制醫院評鑑優等及乙類教學 評鑑制度 94.1 新增 
 36 新制醫院評鑑優等 評鑑制度 94.1 新增 B-2 
 37 新制醫院評鑑合格及甲類教學 評鑑制度 94.1 新增 
 38 新制醫院評鑑合格及乙類教學 評鑑制度 94.1 新增 
 39 新制醫院評鑑合格 評鑑制度 94.1 新增 
 40 新制精神科醫院評鑑優等及教學 評鑑制度 94.1 新增 
 41 新制精神科醫院評鑑優等 評鑑制度 94.1 新增 
 42 新制精神科醫院評鑑合格及教學 評鑑制度 94.1 新增 
 43 新制精神科醫院評鑑合格 評鑑制度 94.1 新增
 98 特約藥局
 99 其它／基層診所
 XX 不詳

")

# echo $test32


 echo $test32 | sed -r 's/( [0-4][0-9] )/ \n\1/g' #  | awk '{print $1, $2, $3}'

#+END_SRC

#+RESULTS:
代碼 名稱 備註 
 01 醫學中心 89 年度起必為甲類教學醫院 
 02 準醫學中心 89 年起醫院評鑑不再受理申請 
 03 區域醫院 88 年度增加區域非教學醫院；89 年度可自由選擇為甲類/乙類教學 醫院 
 04 準區域醫院 89 年起醫院評鑑不再受理申請 
 05 特殊功能教學醫院 89 年起醫院評鑑不再受理申請 
 06 地區教學醫院 
 07 地區醫院 
 08 精神專科教學醫院 
 09 精神專科醫院 
 11 醫院評鑑優等 
 12 醫院評鑑優等及教學合 格 
 17 地區醫院(合格一年暫准合格) 89 年起醫院評鑑不再受理申請 
 19 精神專科醫院(合格一年暫准合格) 89 年起醫院評鑑不再受理申請 
 21 西醫醫院(非評鑑、不合格) 
 22 中醫醫院(非評鑑、不合格) 
 31 新制醫院評鑑特優及甲類教學 評鑑制度 94.1 新增 
 32 新制醫院評鑑特優及乙類教學 評鑑制度 94.1 新增 
 33 新制醫院評鑑特優 評鑑制度 94.1 新增 
 34 新制醫院評鑑優等及甲類教學 評鑑制度 94.1 新增 
 35 新制醫院評鑑優等及乙類教學 評鑑制度 94.1 新增 
 36 新制醫院評鑑優等 評鑑制度 94.1 新增 B-2 
 37 新制醫院評鑑合格及甲類教學 評鑑制度 94.1 新增 
 38 新制醫院評鑑合格及乙類教學 評鑑制度 94.1 新增 
 39 新制醫院評鑑合格 評鑑制度 94.1 新增 
 40 新制精神科醫院評鑑優等及教學 評鑑制度 94.1 新增 
 41 新制精神科醫院評鑑優等 評鑑制度 94.1 新增 
 42 新制精神科醫院評鑑合格及教學 評鑑制度 94.1 新增 
 43 新制精神科醫院評鑑合格 評鑑制度 94.1 新增 98 特約藥局 99 其它／基層診所 XX 不詳





 
